app/controllers/api/v1/games_controller.rb

        def index
          @game = Game.all
---
SELECT "games".* FROM "games"

        def show
          begin
            @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 1]]

        def create
          @game = Game.new(game_params)
          @game.save
---
INSERT INTO "games" ("home", "away", "home_score", "away_score", "championship", "place", "date", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)