app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
        def index
          @game = Game.all

INSERT INTO "games" ("home", "away", "home_score", "away_score", "championship", "place", "date", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
        def create
          @game = Game.new(game_params)
          p @game
          @game.save